Tekla Open API Reference for Tekla Structures 2025
UserDefinedElement Methods
The UserDefinedElement type exposes the following members.
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
UserDefinedElement Class
Tekla.Structures.Drawing Namespace